a = 3
b = 2

print(a + b) # 5
print(a - b) # 1
print(a * b) # 6
print(a / b) # 1.5

s = '1992'
year = int(s) # превращение в целочисленный тип данных

print(year) # переменная year имеет целочисленный тип данных, а переменная s – строковый тип данных

num1 = input('введи:') # ввод
num2 = input('введи:')

print(num1 + num2)

num1 = int(input('введи:')) # ввод только целочисленный  тип данных
num2 = int(input('введи:'))

print(num1 + num2)


print(2 ** 3) # возведение в степень - ответ : 8

print(10 // 4)#//ведёт себя как обычное деление,за исключением того,что он отбрасывает десятичную часть результата

print(10 % 3) #  возвращает остаток от деления двух целых чисел  ответ - 1
#10 % 3	сколько влезает? - 3   (3×3=9)	10−9 = 1
#10 % 5	сколько влезает? - 2 (5×2=10)	10−10 = 0	0
#x % 2 проверка на чётность (остаток 0 → чётное, 1 → нечётное).
#x % 10 → получить последнюю цифру числа.